'''Задача 2: Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) '''

a = str(input("enter number (3 digits): "))
print(f"{a} -> {int(a[0])+int(a[1])+int(a[2])}")
